Project/Toir/src/DataProcessors/торо_МобильныеПриложения/торо_МобильныеПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_МобильныеПриложения</name>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/торо_МобильныеПриложения/торо_МобильныеПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МобильныеПриложения</name>
  <resources>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.mobile</types>
      <types>ExchangePlanRef.mobileBrigades</types>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МобильноеПриложение</name>
    <type>
      <types>EnumRef.торо_МобильноеПриложение</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_МобильноеПриложение/торо_МобильноеПриложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_МобильноеПриложение</name>
  <enumValues>
    <name>Регистратор</name>
  </enumValues>
  <enumValues>
    <name>МобильныеБригады</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/DataProcessors/торо_МобильныеПриложения/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицыУзловРегистратор();
	ЗаполнитьТаблицыУзловБригады();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВведенКлюч" Тогда
		ЗаполнитьТаблицыУзловРегистратор();
		ЗаполнитьТаблицыУзловБригады();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУзлыРегистратор
&НаКлиенте
Процедура УзлыРегистраторНаименованиеПриИзменении(Элемент)
	ТекДанные = Элементы.УзлыРегистратор.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ИзменитьНаименованиеУзла(ТекДанные.ID, ТекДанные.Наименование);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУзлыБригады
//ОБЩЕЕ
&НаКлиенте
Процедура УзлыБригадыНаименованиеПриИзменении(Элемент)
	ТекДанные = Элементы.УзлыБригады.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ИзменитьНаименованиеУзла(ТекДанные.ID, ТекДанные.Наименование);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВвестиКлюч(Команда)
	ОткрытьФорму("Обработка.торо_МобильныеПриложения.Форма.ФормаВводаКлюча",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУзлов(Команда)
	ОткрытьФорму("Обработка.торо_МобильныеПриложения.Форма.ФормаПодразделений",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МестоположенияСотрудников(Команда)
	ОткрытьФорму("Обработка.торо_МобильныеПриложения.Форма.ФормаТрекинга",, ЭтаФорма);
КонецПроцедуры

//РЕГИСТРАТОР
&НаКлиенте
Процедура ОбновитьРегистратор(Команда)
	ЗаполнитьТаблицыУзловРегистратор();
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьРегистратор(Команда)
	Таблица = Новый Массив();
	
	Для Каждого Строка Из Элементы.УзлыРегистратор.ВыделенныеСтроки Цикл
		Стр = УзлыРегистратор.НайтиПоИдентификатору(Строка);
	    Таблица.Добавить(Стр.ID);
	КонецЦикла;
	
	ОткрытьФорму("Обработка.торо_МобильныеПриложения.Форма.ФормаЗапроса",
		Новый Структура("Запрос, Приложение, Таблица", "Продлить", ПолучитьСсылкуНаПеречисление("Регистратор"), Таблица), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьРегистратор(Команда)
	ОткрытьФорму("Обработка.торо_МобильныеПриложения.Форма.ФормаЗапроса",
		Новый Структура("Запрос, Приложение", "Увеличить", ПолучитьСсылкуНаПеречисление("Регистратор")), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтвязатьРегистратор(Команда)
	ТекДанные = Элементы.УзлыРегистратор.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		УдалитьУзелНаСервере(ТекДанные.ID);
		ЗаполнитьТаблицыУзловРегистратор();
	КонецЕсли;
КонецПроцедуры

//БРИГАДЫ
&НаКлиенте
Процедура ОбновитьБригады(Команда)
	ЗаполнитьТаблицыУзловБригады();
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьБригады(Команда)
	Таблица = Новый Массив();
	
	Для Каждого Строка Из Элементы.УзлыБригады.ВыделенныеСтроки Цикл
		Стр = УзлыБригады.НайтиПоИдентификатору(Строка);
	    Таблица.Добавить(Стр.ID);
	КонецЦикла;
	
	ОткрытьФорму("Обработка.торо_МобильныеПриложения.Форма.ФормаЗапроса",
		Новый Структура("Запрос, Приложение, Таблица", "Продлить", ПолучитьСсылкуНаПеречисление("МобильныеБригады"), Таблица), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьБригады(Команда)
	ОткрытьФорму("Обработка.торо_МобильныеПриложения.Форма.ФормаЗапроса",
		Новый Структура("Запрос, Приложение", "Увеличить", ПолучитьСсылкуНаПеречисление("МобильныеБригады")), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтвязатьБригады(Команда)
	ТекДанные = Элементы.УзлыБригады.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		УдалитьУзелНаСервере(ТекДанные.ID);
		ЗаполнитьТаблицыУзловБригады();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//ОБЩЕЕ 
&НаСервереБезКонтекста
Процедура ИзменитьНаименованиеУзла(ID, Наименование)
	НЗ = РегистрыСведений.торо_МобильныеПриложения.СоздатьНаборЗаписей();
	НЗ.Отбор.ID.Установить(ID);
	НЗ.Прочитать();
	
	Для Каждого НС Из НЗ Цикл
		
		НС.Наименование = Наименование;
		
	КонецЦикла;
	
	Попытка
		НЗ.Записать();
	Исключение
		ТекстСообщения = НСтр("es='La falta al cambio de nombre del nudo';ru='Ошибка при переименовании узла';en='Error renaming node'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьУзелНаСервере(ID)
	НЗ = РегистрыСведений.торо_МобильныеПриложения.СоздатьНаборЗаписей();
	НЗ.Отбор.ID.Установить(ID);
	НЗ.Прочитать();
	
	Для Каждого НС Из НЗ Цикл
		
		НС.Наименование = "";
		НС.Узел = Неопределено;
		
	КонецЦикла;
	
	Попытка
		НЗ.Записать();
	Исключение
		ТекстСообщения = НСтр("es='La falta a отвязки del nudo';ru='Ошибка при отвязки узла';en='Error unbind node'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаПеречисление(Приложение)
	Возврат Перечисления.торо_МобильноеПриложение[Приложение];
КонецФункции

//РЕГИСТРАТОР
&НаСервере
Процедура ЗаполнитьТаблицыУзловРегистратор()
	УзлыРегистратор.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_МобильныеПриложения.Узел КАК Узел,
	               |	торо_МобильныеПриложения.ID КАК ID,
	               |	торо_МобильныеПриложения.Наименование КАК Наименование,
	               |	торо_МобильныеПриложения.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.торо_МобильныеПриложения КАК торо_МобильныеПриложения
	               |ГДЕ
	               |	торо_МобильныеПриложения.МобильноеПриложение = ЗНАЧЕНИЕ(Перечисление.торо_МобильноеПриложение.Регистратор)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СЧ = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Узел) Тогда
			СЧ = СЧ + 1;
		КонецЕсли;
		
		НС = УзлыРегистратор.Добавить();
		НС.ID						= Выборка.ID;
		НС.Узел						= Выборка.Узел;
		НС.Наименование				= Выборка.Наименование;
		
		ДатаОкончания = Обработки.торо_МобильныеПриложения.ПолучитьДатуОкончания_Session(Выборка.ДатаОкончания);
		
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			Стр = Формат(ДатаОкончания, "ДФ=dd.MM.yy");
			Если ДатаОкончания <= ТекущаяДата() Тогда
				Стр = "(не действует) " + Стр;
			КонецЕсли;
			
			НС.ДатаОкончания = Стр;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Узел) Тогда
			
			НС.IDУзла					= Выборка.Узел.ИДМобильногоУстройства;
			НС.ИмяУстройства			= Выборка.Узел.ИмяУстройства;
			НС.ПоследнийПользователь	= Выборка.Узел.ПоследнийПользователь;
			НС.ДатаПоследнегоСоединения	= Выборка.Узел.ДатаПоследнегоСоединения;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.КоличествоКлючейРегистратор.Заголовок = СтрШаблон(НСтр("es='La cantidad %1 / del %2';ru='Количество %1/%2';en='Number %1 /%2'"), СЧ, ПолучитьМаксимальноеКоличествоУзловРегистратор());
КонецПроцедуры

&НаСервере
Функция ПолучитьМаксимальноеКоличествоУзловРегистратор()
	Возврат Обработки.торо_МобильныеПриложения.ПолучитьЧислоМаксимальногоКоличестваУзловРегистратор_Session();
КонецФункции

//БРИГАДЫ
&НаСервере
Процедура ЗаполнитьТаблицыУзловБригады()
	УзлыБригады.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_МобильныеПриложения.Узел КАК Узел,
	               |	торо_МобильныеПриложения.ID КАК ID,
	               |	торо_МобильныеПриложения.Наименование КАК Наименование,
	               |	торо_МобильныеПриложения.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.торо_МобильныеПриложения КАК торо_МобильныеПриложения
	               |ГДЕ
	               |	торо_МобильныеПриложения.МобильноеПриложение = ЗНАЧЕНИЕ(Перечисление.торо_МобильноеПриложение.МобильныеБригады)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СЧ = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Узел) Тогда
			СЧ = СЧ + 1;
		КонецЕсли;
		
		НС = УзлыБригады.Добавить();
		НС.ID						= Выборка.ID;
		НС.Узел						= Выборка.Узел;
		НС.Наименование				= Выборка.Наименование;
		
		ДатаОкончания = Обработки.торо_МобильныеПриложения.ПолучитьДатуОкончания_Session(Выборка.ДатаОкончания);
		
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			Стр = Формат(ДатаОкончания, "ДФ=dd.MM.yy");
			Если ДатаОкончания <= ТекущаяДата() Тогда
				Стр = "(не действует) " + Стр;
			КонецЕсли;
			
			НС.ДатаОкончания = Стр;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Узел) Тогда
			
			НС.IDУзла					= Выборка.Узел.ИДМобильногоУстройства;
			НС.ИмяУстройства			= Выборка.Узел.ИмяУстройства;
			НС.ПоследнийПользователь	= Выборка.Узел.ПоследнийПользователь;
			НС.ДатаПоследнегоСоединения	= Выборка.Узел.ДатаПоследнегоСоединения;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.КоличествоКлючейБригады.Заголовок = СтрШаблон(НСтр("es='La cantidad %1 / del %2';ru='Количество %1/%2';en='Number %1 /%2'"), СЧ, ПолучитьМаксимальноеКоличествоУзловБригады());
КонецПроцедуры

&НаСервере
Функция ПолучитьМаксимальноеКоличествоУзловБригады()
	Возврат Обработки.торо_МобильныеПриложения.ПолучитьЧислоМаксимальногоКоличестваУзловБригады_Session();
КонецФункции
#КонецОбласти
